# AdditionalDefRecords

## Description
Shows the Additional Default Records dialog.

```pascal
PROCEDURE AdditionalDefRecords;
```

```python
def vs.AdditionalDefRecords():
    return None
```

## Examples
```pascal
AdditionalDefRecords;
```
```python
import vs

# Shows the Additional Default Records dialog.
vs.AdditionalDefRecords()
newObj = vs.LNewObj()  # handle to the newly created object
```

## Version
Availability: from Vectorworks 2014

## Category
* Spotlight